packages/StoveOpt/StoveOpt-0.3.5-py2-none-any.whl/StoveOpt/foamfiles/counterFlowFlame2D/0_template/U_template
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }
    primary_air
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }
                                                
												
												
												
												
												
												
												
												
												
												
												
												  
												  
												  
												  
												   
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
	stove_body
    {
        type            noSlip; //no slip boundary
    }
	
	
	
}


// ************************************************************************* //
