packages/StoveOpt/StoveOpt-0.3.5-py2-none-any.whl/StoveOpt/foamfiles/counterFlowFlame2D/system/Obselete/blockMeshDict_notflipped_wc
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(0.0 0.1 0.0)
(0.1 0.1 0.0)
(0.0 0.1 0.15)
(0.1 0.1 0.15)
(0.1 0.1 0.16)
(0.0 0.1 0.16)
(0.0 0.1 0.3)
(0.1 0.1 0.3)
(0.17 0.1 0.3)
(-0.07 0.1 0.3)
(-0.07 0.1 0.5)
(-0.04 0.1 0.5)
(0.14 0.1 0.5)
(0.17 0.1 0.5)
(-0.04 0.1 0.33)
(0.14 0.1 0.33)
(0.025 0.1 0.076)
(0.075 0.1 0.076)
(0.075 0.1 0.152)
(0.025 0.1 0.152)
(0.0 0.1 0.33)
(0.1 0.1 0.33)
(0.0 -0.1 0.0)
(0.1 -0.1 0.0)
(0.0 -0.1 0.15)
(0.1 -0.1 0.15)
(0.1 -0.1 0.16)
(0.0 -0.1 0.16)
(0.0 -0.1 0.3)
(0.1 -0.1 0.3)
(0.17 -0.1 0.3)
(-0.07 -0.1 0.3)
(-0.07 -0.1 0.5)
(-0.04 -0.1 0.5)
(0.14 -0.1 0.5)
(0.17 -0.1 0.5)
(-0.04 -0.1 0.33)
(0.14 -0.1 0.33)
(0.025 -0.1 0.076)
(0.075 -0.1 0.076)
(0.075 -0.1 0.152)
(0.025 -0.1 0.152)
(0.0 -0.1 0.33)
(0.1 -0.1 0.33)
(-0.04 0.1 0.3)
(-0.04 -0.1 0.3)
(0.14 0.1 0.3)
(0.14 -0.1 0.3)                                                                                                                                    
);

blocks
(
    hex (16 17 39 38 19 18 40 41) (1 1 1) simpleGrading (1 1 1) 
    hex (0 1 23 22 2 3 25 24) (1 1 1) simpleGrading (1 1 1)
    hex (5 4 26 27 6 7 29 28) (1 1 1) simpleGrading (1 1 1)
	hex (2 3 25 24 5 4 26 27) (1 1 1) simpleGrading (1 1 1)
	hex (6 7 29 28 20 21 43 42) (1 1 1) simpleGrading  (1 1 1)
	hex (7 46 47 29 21 15 37 43) (1 1 1) simpleGrading (1 1 1)
    hex (44 6 28 45 14 20 42 36) (1 1 1) simpleGrading (1 1 1)
    hex (9 44 45 31 10 11 33 32) (1 1 1) simpleGrading (1 1 1)
	hex (46 8 30 47 12 13 35 34) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
         			
        );
    }
    primary_air
    {
        type patch;
        faces
        (
        	
        );
    }
    secondary_air_RHS
    {
		type patch;
		faces
		(
							
		);
    }
    secondary_air_LHS
    {
		type patch;
		faces
		(
			
		);
    }
    outlet
    {
        type patch;
        faces
        (
        			
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (	
			
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //